examples/ws-security/src/test/org/codehaus/xfire/demo/dotnetreq.xml

<?xml version="1.0" encoding="utf-8"?>
    <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" 
      xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
      xmlns:xsd="http://www.w3.org/2001/XMLSchema">
      <soap:Body>
        <findBook xmlns="http://xfire.codehaus.org/BookService">
          <in0>0123456789</in0>
        </findBook>
      </soap:Body>
    </soap:Envelope> 